<?php

// GMOペイメントのエラー情報取得用クラス
class MulLinkPlus {
    const ERRORS = "
EZ1	EZ1000008	パラメータトークンの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL 不正	
EZ1	EZ1000010	パラメータトークンが一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL 不正	
EZ1	EZ1001001	設定IDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			configid 未指定	
EZ1	EZ1001005	設定IDが16桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			configid 桁数超過	
EZ1	EZ1001008	設定IDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			configid 書式不正	
EZ1	EZ1002001	取引共通情報が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction 未指定	
EZ1	EZ1003001	オーダーIDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.OrderID 未指定	
EZ1	EZ1003005	オーダーIDが27桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.OrderID 桁数超過	
EZ1	EZ1003008	オーダーIDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.OrderID 書式不正	
EZ1	EZ1004001	利用金額が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Amount 未指定	
EZ1	EZ1004005	利用金額が12桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Amount 桁数超過	
EZ1	EZ1004006	利用金額に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Amount 書式不正	
EZ1	EZ1005005	税送料が12桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Tax 桁数超過	
EZ1	EZ1005006	税送料に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Tax 書式不正	
EZ1	EZ1006008	加盟店自由項目1の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ClientField1 書式不正	
EZ1	EZ1006012	加盟店自由項目1が100バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ClientField1 桁数超過	
EZ1	EZ1007008	加盟店自由項目2の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ClientField2 書式不正	
EZ1	EZ1007012	加盟店自由項目2が100バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ClientField2 桁数超過	
EZ1	EZ1008008	加盟店自由項目3の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ClientField3 書式不正	
EZ1	EZ1008012	加盟店自由項目3が100バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ClientField3 桁数超過	
EZ1	EZ1009008	取引概要の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Overview 書式不正	
EZ1	EZ1009012	取引概要が64バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Overview 桁数超過	
EZ1	EZ1010005	取引詳細が256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Detail 桁数超過	
EZ1	EZ1010008	取引詳細の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.Detail 書式不正	
EZ1	EZ1011008	利用可能決済手段の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.PayMethods 書式不正	
EZ1	EZ1011016	利用可能決済手段は利用可能な選択肢が存在しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.PayMethods 指定不正	
EZ1	EZ1012005	戻り先URLが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.RetUrl 桁数超過	
EZ1	EZ1013005	決済完了通知先メールアドレスが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.NotifyMailaddress 桁数超過	
EZ1	EZ1013008	決済完了通知先メールアドレスの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.NotifyMailaddress 書式不正	
EZ1	EZ1014005	リトライ最大回数が2桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.RetryMax 桁数超過	
EZ1	EZ1014006	リトライ最大回数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.RetryMax 書式不正	
EZ1	EZ1015005	取引有効日数が2桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ExpireDays 桁数超過	
EZ1	EZ1015006	取引有効日数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ExpireDays 書式不正	
EZ1	EZ1018001	画面表示設定が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting 未指定	
EZ1	EZ1019001	テンプレートIDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.TemplateID 未指定	
EZ1	EZ1019005	テンプレートIDが16桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.TemplateID 桁数超過	
EZ1	EZ1019008	テンプレートIDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.TemplateID 書式不正	
EZ1	EZ1020005	ロゴ画像のURLが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.LogoUrl 桁数超過	
EZ1	EZ1021005	ショップ名が128桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopName 桁数超過	
EZ1	EZ1021008	ショップ名の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopName 書式不正	
EZ1	EZ1023005	言語コードが2桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.Lang 桁数超過	
EZ1	EZ1023008	言語コードの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.Lang 書式不正	
EZ1	EZ1024001	処理区分が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			【各決済手段】.JobCd 未指定	
EZ1	EZ1024008	処理区分の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			【各決済手段】.JobCd 書式不正	
EZ1	EZ1024010	処理区分が一致しません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.JobCd 不正	
EZ1	EZ1025008	商品コードの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.ItemCode 書式不正	
			dcc.ItemCode 書式不正	
EZ1	EZ1026008	本人認証サービス利用フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.TdFlag 書式不正	
			dcc.TdFlag 書式不正	
EZ1	EZ1026010	本人認証サービス利用フラグが一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.TdFlag 相関不正	
EZ1	EZ1027008	3Dセキュア表示店舗名の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.TdTenantName 書式不正	
			dcc.TdTenantName 書式不正	
EZ1	EZ1027012	3Dセキュア表示店舗名が25バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.TdTenantName 桁数超過	
			dcc.TdTenantName 桁数超過	
EZ1	EZ1028008	支払方法（単一指定）の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Method 書式不正	
EZ1	EZ1028010	支払方法（単一指定）が一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Method 不正	
EZ1	EZ1029005	支払回数が2桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.PayTimes 書式不正	
EZ1	EZ1029006	支払回数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.PayTimes 書式不正	
EZ1	EZ1029010	支払回数が一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.PayTimes 書式不正	
EZ1	EZ1031008	会員IDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.MemberID 書式不正	
			dcc.MemberID 書式不正	
EZ1	EZ1036005	メールアドレスは半角256文字以内で入力してください。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.MailAddress 桁数超過	
			payeasy.MailAddress 桁数超過	
EZ1	EZ1036008	メールアドレスに使用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.MailAddress 書式不正	
			payeasy.MailAddress 書式不正	
EZ1	EZ1037012	氏名は半角40文字、全角20文字以内で入力してください。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.CustomerName 書式不正	
			payeasy.CustomerName 書式不正	
EZ1	EZ1038008	フリガナに使用できない文字が含まれています。【使用可能文字：半角（スペース、英数字）※半角カタカナは不可、全角文字】	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.CustomerKana 書式不正	
			payeasy.CustomerKana 書式不正	
EZ1	EZ1038012	入力できる文字数を超えています。【入力可能文字数：半角40文字（半角カタカナは不可）、全角20文字】	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.CustomerKana 桁数超過	
			payeasy.CustomerKana 桁数超過	
EZ1	EZ1039005	電話番号は13桁以内で入力してください。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.TelNo 桁数超過	
			payeasy.TelNo 桁数超過	
EZ1	EZ1039008	電話番号に使用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.TelNo 書式不正	
			payeasy.TelNo 書式不正	
EZ1	EZ1040001	ショップIDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL ショップID 未指定	
EZ1	EZ1040002	ショップIDが存在しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL ショップID不正	
EZ1	EZ1040008	ショップIDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL ショップID 書式不正	
EZ1	EZ1042009	再実行回数が規定値を超えています。	リトライ最大回数超過エラー	エラー回数が規定値を超えました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ1	EZ1043015	URLの有効期限日を過ぎています。	URL有効期限日超過エラー	取引の有効期限切れです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ1	EZ1044002	カード情報が存在しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.MemberID カード未登録会員ID指定	
			dcc.MemberID カード未登録会員ID指定	
EZ1	EZ1045005	加盟店メールアドレスが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ShopMailAddress 桁数超過	
			payeasy.ShopMailAddress 桁数超過	
EZ1	EZ1045008	加盟店メールアドレスの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ShopMailAddress 書式不正	
			payeasy.ShopMailAddress 書式不正	
EZ1	EZ1046008	予約番号の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReserveNo 書式不正	
EZ1	EZ1046012	予約番号が20バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReserveNo 桁数超過	
EZ1	EZ1047008	会員番号の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.MemberNo 書式不正	
EZ1	EZ1047012	会員番号が20バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
				
			cvs.MemberNo 桁数超過	
EZ1	EZ1048008	POSレジ表示欄1の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp1 書式不正	
EZ1	EZ1048012	POSレジ表示欄1が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp1 桁数超過	
EZ1	EZ1049008	POSレジ表示欄2の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp2 書式不正	
EZ1	EZ1049012	POSレジ表示欄2が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp2 桁数超過	
EZ1	EZ1050008	POSレジ表示欄3の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp3 書式不正	
EZ1	EZ1050012	POSレジ表示欄3が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp3 桁数超過	
EZ1	EZ1051008	POSレジ表示欄4の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp4 書式不正	
EZ1	EZ1051012	POSレジ表示欄4が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp4 桁数超過	
EZ1	EZ1052008	POSレジ表示欄5の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp5 書式不正	
EZ1	EZ1052012	POSレジ表示欄5が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp5 桁数超過	
EZ1	EZ1053008	POSレジ表示欄6の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp6 書式不正	
EZ1	EZ1053012	POSレジ表示欄6が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp6 桁数超過	
EZ1	EZ1054008	POSレジ表示欄7の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp7 書式不正	
EZ1	EZ1054012	POSレジ表示欄7が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp7 桁数超過	
EZ1	EZ1055008	POSレジ表示欄8の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp8 書式不正	
EZ1	EZ1055012	POSレジ表示欄8が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.RegisterDisp8 桁数超過	
EZ1	EZ1056008	レシート表示欄1の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp1 書式不正	
EZ1	EZ1056012	レシート表示欄1が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp1 桁数超過	
EZ1	EZ1057008	レシート表示欄2の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp2 書式不正	
EZ1	EZ1057012	レシート表示欄2が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp2桁数超過	
EZ1	EZ1058008	レシート表示欄3の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp3 書式不正	
EZ1	EZ1058012	レシート表示欄3が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp3 桁数超過	
EZ1	EZ1059008	レシート表示欄4の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp4 書式不正	
EZ1	EZ1059012	レシート表示欄4が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp4 桁数超過	
EZ1	EZ1060008	レシート表示欄5の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp5 書式不正	
EZ1	EZ1060012	レシート表示欄5が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp5 桁数超過	
EZ1	EZ1061008	レシート表示欄6の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp6 書式不正	
EZ1	EZ1061012	レシート表示欄6が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp6 桁数超過	
EZ1	EZ1062008	レシート表示欄7の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp7 書式不正	
EZ1	EZ1062012	レシート表示欄7が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp7 桁数超過	
EZ1	EZ1063008	レシート表示欄8の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp8 書式不正	
EZ1	EZ1063012	レシート表示欄8が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp8 桁数超過	
EZ1	EZ1064008	レシート表示欄9の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp9 書式不正	
EZ1	EZ1064012	レシート表示欄9が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp9 桁数超過	
EZ1	EZ1065008	レシート表示欄10の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp10 書式不正	
EZ1	EZ1065012	レシート表示欄10が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp10 桁数超過	
EZ1	EZ1066001	お問い合わせ先が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp11 未指定	
			payeasy.ReceiptsDisp11 未指定	
EZ1	EZ1066008	お問い合わせ先の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp11 書式不正	
			payeasy.ReceiptsDisp11 書式不正	
EZ1	EZ1066012	お問い合わせ先が60バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp11 桁数超過	
			payeasy.ReceiptsDisp11 桁数超過	
EZ1	EZ1067001	お問い合わせ先電話番号が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp12 未指定	
			payeasy.ReceiptsDisp12 未指定	
EZ1	EZ1067005	お問い合わせ先電話番号が12桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp12 桁数超過	
			payeasy.ReceiptsDisp12 桁数超過	
EZ1	EZ1067008	お問い合わせ先電話番号の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp12 書式不正	
			payeasy.ReceiptsDisp12 書式不正	
EZ1	EZ1068001	お問い合わせ先受付時間が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp13 未指定	
			payeasy.ReceiptsDisp13 未指定	
EZ1	EZ1068005	お問い合わせ先受付時間が11桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp13 桁数超過	
			payeasy.ReceiptsDisp13 桁数超過	
EZ1	EZ1068008	お問い合わせ先受付時間の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.ReceiptsDisp13 書式不正	
			payeasy.ReceiptsDisp13 書式不正	
EZ1	EZ1069001	CSRFトークンが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL 不正	
EZ1	EZ1070014	すでにオーダーIDが存在しています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL 不正	
EZ1	EZ1073001	会員編集情報が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member 未指定	
EZ1	EZ1031001	会員IDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.MemberID 未指定	
EZ1	EZ1074012	会員名が255バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.MemberName 桁数超過	
				
EZ1	EZ1075008	カード番号取得元決済手段の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.SrcPayMethod 書式不正	
EZ1	EZ1076005	カード番号取得元オーダーIDが27桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.SrcOrderID 桁数超過	
EZ1	EZ1076008	カード番号取得元オーダーIDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.SrcOrderID 桁数書式不正	
EZ1	EZ1077008	カラーパターンの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ColorPattern 設定値不正	
EZ1	EZ1084001	摘要が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.Commodity 未指定	
			aupay.Commodity 未指定	
EZ1	EZ1084008	摘要の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.Commodity 書式不正	
			aupay.Commodity 書式不正	
EZ1	EZ1084012	摘要が48バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.Commodity 桁数超過	
			aupay.Commodity 桁数超過	
EZ1	EZ1085001	表示サービス名が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.ServiceName 未指定	
			aupay.ServiceName 未指定	
EZ1	EZ1085008	表示サービス名の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.ServiceName 書式不正	
			aupay.ServiceName 書式不正	
EZ1	EZ1085012	表示サービス名が48バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.ServiceName 桁数超過	
			aupay.ServiceName 桁数超過	
EZ1	EZ1086001	表示電話番号が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.ServiceTel 未指定	
			aupay.ServiceTel 未指定	
EZ1	EZ1086005	表示電話番号が15桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.ServiceTel 桁数超過	
			aupay.ServiceTel 桁数超過	
EZ1	EZ1086008	表示電話番号の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			au.ServiceTel 書式不正	
			aupay.ServiceTel 書式不正	
EZ1	EZ1088012	ドコモ表示項目1が40バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DocomoDisp1 桁数超過	
EZ1	EZ1088013	ドコモ表示項目1に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DocomoDisp1 書式不正	
EZ1	EZ1089012	ドコモ表示項目2が40バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DocomoDisp2 桁数超過	
EZ1	EZ1089013	ドコモ表示項目2に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DocomoDisp2 書式不正	
EZ1	EZ1090012	利用店舗名が32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispShopName 桁数超過	
EZ1	EZ1090013	利用店舗名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispShopName 書式不正	
EZ1	EZ1091005	連絡先電話番号が13桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispPhoneNumber 桁数超過	
EZ1	EZ1091008	連絡先電話番号の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispPhoneNumber 書式不正	
EZ1	EZ1092005	メールアドレスが96桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispMailAddress 桁数超過	
EZ1	EZ1092008	メールアドレスの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispMailAddress 書式不正	
EZ1	EZ1093012	問い合わせURLが96バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispShopUrl 桁数超過	
EZ1	EZ1093013	問い合わせURLに利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispShopUrl 書式不正	
EZ1	EZ1094012	連絡先情報が96バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			以下の項目の合計桁数超過	
			docomo.DispPhoneNumber	
			docomo.DispMailAddress	
			docomo.DispShopUrl	
EZ1	EZ1095001	カード編集番号が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.Cardeditno未指定	
EZ1	EZ1095008	カード編集番号に使用できない文字が含まれています。【使用可能文字：半角文字　※半角カタカナおよび全角文字は不可】	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.Cardeditno書式不正	
EZ1	EZ1095012	カード編集番号が27バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.Cardeditno桁数超過	
EZ1	EZ1097001	商品名が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.ProductName未指定	
EZ1	EZ1097012	商品名が4000バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.ProductName 桁数超過	
EZ1	EZ1098012	商品画像URLが500バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.ProductImageUrl 桁数超過	
EZ1	EZ1099012	LINE member IDが50バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.Mid 桁数超過	
EZ1	EZ1101012	言語コードが10バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.LangCd 桁数超過	
EZ1	EZ1103012	認証連携トークンが256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			famipay.AuthToken 桁数超過	
EZ1	EZ1104001	メルペイ商品情報が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items 未指定	
EZ1	EZ1105001	メルペイ商品カテゴリIDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items[CategoryId] 未指定	
EZ1	EZ1105012	メルペイ商品カテゴリIDが4バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items[CategoryId] 桁数超過	
EZ1	EZ1106010	URLパラメータのJSON構造が不正です。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			JSON 書式不正	
EZ1	EZ1107001	URLパラメータが指定されていません。	リクエストパラメータエラー	－
			geturlparam 未指定	
EZ1	EZ1108001	送信元メールアドレス(FROM)、メール送信元名が指定されていません。	リクエストパラメータエラー	－
		両方設定するか、両方未設定にしてください。	geturlparam.FromSendMailName	
			geturlparam.FromSendMailAddress	
			未指定	
EZ1	EZ1109001	送信先メールアドレス(TO)が指定されていません。	リクエストパラメータエラー	－
			geturlparam.SendMailAddress 未指定	
EZ1	EZ1109008	送信先メールアドレス(TO)の書式が不正です。	リクエストパラメータエラー	－
			geturlparam.SendMailAddress 書式不正	
EZ1	EZ1109012	送信先メールアドレス(TO)が256バイトを超えています。	リクエストパラメータエラー	－
			geturlparam.SendMailAddress 桁数超過	
EZ1	EZ1110001	顧客名が指定されていません。	リクエストパラメータエラー	－
			geturlparam.CustomerName 未指定	
EZ1	EZ1110005	顧客名が40桁を超えています。	リクエストパラメータエラー	－
			geturlparam.CustomerName 桁数超過	
EZ1	EZ1112001	テンプレートNo. が指定されていません。	リクエストパラメータエラー	－
			geturlparam.TemplateNo 未指定	
EZ1	EZ1112008	テンプレートNo. の書式が正しくありません。	リクエストパラメータエラー	－
			geturlparam.TemplateNo 書式不正	
EZ1	EZ1134008	決済URL案内メール送信フラグ／カード編集URL案内メール送信フラグの書式が正しくありません。	リクエストパラメータエラー	－
			geturlparam.GuideMailSendFlag 書式不正	
EZ1	EZ1137008	送信先メールアドレス(BCC)の書式が正しくありません。	リクエストパラメータエラー	－
			geturlparam.BccSendMailAddress 書式不正	
EZ1	EZ1137012	送信先メールアドレス(BCC)が256バイトを超えています。	リクエストパラメータエラー	－
			geturlparam.BccSendMailAddress 桁数超過	
EZ1	EZ1138001	商品IDが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemId 未指定	
EZ1	EZ1138005	商品IDが100桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemId 桁数超過	
EZ1	EZ1138008	商品IDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemId 書式不正	
EZ1	EZ1139005	商品サブIDが77桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemSubId 桁数超過	
EZ1	EZ1139008	商品サブIDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemSubId 書式不正	
EZ1	EZ1140001	商品名が指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemName 未指定	
EZ1	EZ1140012	商品名が255バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenid.ItemName 桁数超過	
EZ1	EZ1141013	商品名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Name 書式不正	
EZ1	EZ1142013	商品説明に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Description 書式不正	
EZ1	EZ1143009	商品画像URL一覧が9件を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 件数超過	
EZ1	EZ1144012	商品画像URL1が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1145012	商品画像URL2が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1146012	商品画像URL3が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1147012	商品画像URL4が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1148012	商品画像URL5が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1149012	商品画像URL6が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1150012	商品画像URL7が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1151012	商品画像URL8が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1152012	商品画像URL9が256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ImageUrls 桁数超過	
EZ1	EZ1153005	カテゴリ名が40桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Category 桁数超過	
EZ1	EZ1153013	カテゴリ名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Category 書式不正	
EZ1	EZ1154005	サイズが40桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Size 桁数超過	
EZ1	EZ1154013	サイズに利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Size 書式不正	
EZ1	EZ1155005	ブランド名が40桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Brand 桁数超過	
EZ1	EZ1155013	ブランド名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Brand 書式不正	
EZ1	EZ1156005	色が40桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Color 桁数超過	
EZ1	EZ1156013	色に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Color 書式不正	
EZ1	EZ1157005	定価が7桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ListPrice 桁数超過	
EZ1	EZ1157006	定価に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ListPrice 書式不正	
EZ1	EZ1157011	定価が1～1000000の範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ListPrice 範囲超過	
EZ1	EZ1158005	購入時価格が7桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.UnitPrice 桁数超過	
EZ1	EZ1158006	購入時価格に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.UnitPrice 書式不正	
EZ1	EZ1158011	購入時価格が1～1000000の範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.UnitPrice 範囲超過	
EZ1	EZ1159005	購入数が4桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Quantity 桁数超過	
EZ1	EZ1159006	購入数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Quantity 書式不正	
EZ1	EZ1160005	製品管理コードが40桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ItemCode 桁数超過	
EZ1	EZ1160013	製品管理コードに利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.ItemCode 書式不正	
EZ1	EZ1161011	JANコードが8～13文字の範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.JanCode 範囲不正	
EZ1	EZ1161013	JANコードに利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.JanCode 書式不正	
EZ1	EZ1162010	税送料算出方法が一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.TaxCalcFlag 書式不正	
EZ1	EZ1163001	税送料計算URLが指定されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.TaxCalcURL 未指定	
EZ1	EZ1163012	税送料計算URLが256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.TaxCalcURL 桁数超過	
EZ1	EZ1164010	個人情報利用フラグが一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			merpay.Items.Name 桁数超過	
EZ1	EZ1165008	3DS2.0未対応時取り扱いの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2Type 書式不正	
			dcc.Tds2Type 書式不正	
EZ1	EZ1166008	カード会員最終更新日の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ChAccChange 書式不正	
			dcc.Tds2ChAccChange 書式不正	
EZ1	EZ1167008	カード会員作成日の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ChAccDate 書式不正	
			dcc.Tds2ChAccDate 書式不正	
EZ1	EZ1168008	カード会員パスワード変更日の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ChAccPwChange 書式不正	
			dcc.Tds2ChAccPwChange 書式不正	
EZ1	EZ1169005	過去6ヶ月間の購入回数が4桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2NbPurchaseAccount 桁数超過	
			dcc.Tds2NbPurchaseAccount 桁数超過	
EZ1	EZ1169006	過去6ヶ月間の購入回数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2NbPurchaseAccount 書式不正	
			dcc.Tds2NbPurchaseAccount 書式不正	
EZ1	EZ1170008	カード登録日の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2PaymentAccAge 書式不正	
			dcc.Tds2PaymentAccAge 書式不正	
EZ1	EZ1171005	過去24時間のカード追加の試行回数が3桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ProvisionAttemptsDay 桁数超過	
			dcc.Tds2ProvisionAttemptsDay 桁数超過	
EZ1	EZ1171006	過去24時間のカード追加の試行回数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ProvisionAttemptsDay 書式不正	
			dcc.Tds2ProvisionAttemptsDay 書式不正	
EZ1	EZ1172008	配送先住所の初回使用日の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ShipAddressUsage 書式不正	
			dcc.Tds2ShipAddressUsage 書式不正	
EZ1	EZ1173008	カード会員名と配送先名の一致/不一致の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ShipNameInd 書式不正	
			dcc.Tds2ShipNameInd 書式不正	
EZ1	EZ1174008	カード会員の不審行為情報の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2SuspiciousAccActivity 書式不正	
			dcc.Tds2SuspiciousAccActivity 書式不正	
EZ1	EZ1175005	過去24時間の取引回数が3桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2TxnActivityDay 桁数超過	
			dcc.Tds2TxnActivityDay 桁数超過	
EZ1	EZ1175006	過去24時間の取引回数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2TxnActivityDay 書式不正	
			dcc.Tds2TxnActivityDay 書式不正	
EZ1	EZ1176005	前年の取引回数が3桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2TxnActivityYear 桁数超過	
			dcc.Tds2TxnActivityYear 桁数超過	
EZ1	EZ1176006	前年の取引回数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2TxnActivityYear 書式不正	
			dcc.Tds2TxnActivityYear 書式不正	
EZ1	EZ1188008	カード会員のメールアドレスの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2Email 書式不正	
			dcc.Tds2Email 書式不正	
EZ1	EZ1188012	メールアドレスは半角254文字以内で入力してください。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2Email 桁数超過	
			dcc.Tds2Email 桁数超過	
EZ1	EZ1188013	メールアドレスの書式が正しくないか、使用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2Email 書式不正	
			dcc.Tds2Email 書式不正	
EZ1	EZ1189005	自宅電話の国コードが3桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2HomePhoneCC 桁数超過	
			dcc.Tds2HomePhoneCC 桁数超過	
EZ1	EZ1189008	自宅電話の国コードに数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2HomePhoneCC 書式不正	
			dcc.Tds2HomePhoneCC 書式不正	
EZ1	EZ1190005	自宅電話番号が15桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2HomePhoneSubscriber 桁数超過	
			dcc.Tds2HomePhoneSubscriber 桁数超過	
EZ1	EZ1190008	自宅電話番号に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2HomePhoneSubscriber 書式不正	
			dcc.Tds2HomePhoneSubscriber 書式不正	
EZ1	EZ1191005	携帯電話の国コードが3桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2MobilePhoneCC 桁数超過	
			dcc.Tds2MobilePhoneCC 桁数超過	
EZ1	EZ1191008	携帯電話の国コードに数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2MobilePhoneCC 書式不正	
			dcc.Tds2MobilePhoneCC 書式不正	
EZ1	EZ1192005	携帯電話番号が15桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2MobilePhoneSubscriber 桁数超過	
			dcc.Tds2MobilePhoneSubscriber 桁数超過	
EZ1	EZ1192008	携帯電話番号に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2MobilePhoneSubscriber 書式不正	
			dcc.Tds2MobilePhoneSubscriber 書式不正	
EZ1	EZ1193005	職場電話の国コードが3桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2WorkPhoneCC 桁数超過	
			dcc.Tds2WorkPhoneCC 桁数超過	
EZ1	EZ1193008	職場電話の国コードに数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2WorkPhoneCC 書式不正	
			dcc.Tds2WorkPhoneCC 書式不正	
EZ1	EZ1194005	職場電話番号が15桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2WorkPhoneSubscriber 桁数超過	
			dcc.Tds2WorkPhoneSubscriber 桁数超過	
EZ1	EZ1194008	職場電話番号に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2WorkPhoneSubscriber 書式不正	
			dcc.Tds2WorkPhoneSubscriber 書式不正	
EZ1	EZ1202005	納品先電子メールアドレスが254桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2DeliveryEmailAddress 桁数超過	
			dcc.Tds2DeliveryEmailAddress 桁数超過	
EZ1	EZ1203008	商品納品時間枠の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2DeliveryTimeframe 書式不正	
			dcc.Tds2DeliveryTimeframe 書式不正	
EZ1	EZ1204005	プリペイドカードまたはギフトカードの総購入金額が15桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2GiftCardAmount 桁数超過	
			dcc.Tds2GiftCardAmount 桁数超過	
EZ1	EZ1204006	プリペイドカードまたはギフトカードの総購入金額に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2GiftCardAmount 書式不正	
			dcc.Tds2GiftCardAmount 書式不正	
EZ1	EZ1205005	購入されたプリペイドカードまたはギフトカード / コードの総数が2桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2GiftCardCount 桁数超過	
			dcc.Tds2GiftCardCount 桁数超過	
EZ1	EZ1205006	購入されたプリペイドカードまたはギフトカード / コードの総数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2GiftCardCount 書式不正	
			dcc.Tds2GiftCardCount 書式不正	
EZ1	EZ1206005	購入されたプリペイドカードまたはギフトカードの通貨コードが3桁ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2GiftCardCurr 桁数超過	
			dcc.Tds2GiftCardCurr 桁数超過	
EZ1	EZ1207008	商品の発売予定日の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2PreOrderDate 書式不正	
			dcc.Tds2PreOrderDate 書式不正	
EZ1	EZ1208008	商品の販売時期情報の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2PreOrderPurchaseInd 書式不正	
			dcc.Tds2PreOrderPurchaseInd 書式不正	
EZ1	EZ1209008	商品の注文情報の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2ReorderItemsInd 書式不正	
			dcc.Tds2ReorderItemsInd 書式不正	
EZ1	EZ1213008	購入ありがとうメール送信フラグ／登録完了メール送信フラグの書式が正しくありません。	リクエストパラメータエラー	－
			geturlparam.ThanksMailSendFlag 書式不正	
EZ1	EZ1214008	送信元メールアドレス(FROM)の書式が正しくありません。	リクエストパラメータエラー	－
			geturlparam.FromSendMailAddress 書式不正	
EZ1	EZ1214012	送信元メールアドレス(FROM)が256バイトを超えています。	リクエストパラメータエラー	－
			geturlparam.FromSendMailAddress 桁数超過	
EZ1	EZ1215005	送信元名が40桁を超えています。	リクエストパラメータエラー	－
			geturlparam.FromSendMailName 桁数超過	
EZ1	EZ1216008	決済可能期限の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.PaymentExpireDate 書式不正	
EZ1	EZ1216015	URLの表示期限が切れています。	決済可能期限超過エラー	お支払い期限日を過ぎています。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ1	EZ1217008	編集可能期限の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.EditExpireDate 書式不正	
EZ1	EZ1217015	URLの表示期限が切れています。	編集可能期限超過エラー	カード編集期限日を過ぎています。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ1	EZ1218001	ショップパスワードが指定されていません。	リクエストパラメータエラー	－
			geturlparam.ShopPass 未指定	
EZ1	EZ1218008	ショップパスワードの書式が正しくありません。	リクエストパラメータエラー	－
			geturlparam.ShopPass 書式不正	
EZ1	EZ1219008	振込有効日数の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeDays 書式不正	
EZ1	EZ1219012	振込有効日数が2バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeDays 桁数超過	
EZ1	EZ1220012	振込事由が64バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeReason 桁数超過	
EZ1	EZ1220013	振込事由に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeReason 書式不正	
EZ1	EZ1221012	振込依頼者氏名が64バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeClientName 桁数超過	
EZ1	EZ1221013	振込依頼者氏名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeClientName 書式不正	
EZ1	EZ1222008	振込依頼者メールアドレスの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeClientMailaddress 書式不正	
EZ1	EZ1222012	振込依頼者メールアドレスが256バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			virtualaccount.TradeClientMailaddress 桁数超過	
EZ1	EZ1223003	店舗名が100桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.BranchName 桁数超過	
EZ1	EZ1224008	店舗IDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.BranchID 書式不正	
EZ1	EZ1224012	店舗IDが32バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			linepay.BranchID 桁数超過	
EZ1	EZ1225008	サービス種別の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispServiceType	
EZ1	EZ1227003	楽天説明文が300文字を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenpayv2.Description 桁数超過	
EZ1	EZ1228008	優先バージョンの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			rakutenpayv2.PriorityVersion 書式不正	
EZ1	EZ1229008	結果画面スキップフラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ResultSkipFlag 書式不正	
			member.ResultSkipFlag書式不正	
EZ1	EZ1230008	セキュリティコード必須フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.SecCodeRequiredFlag 書式不正	
EZ1	EZ1231008	編集ボタン非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.CardEditHiddenFlag 書式不正	
EZ1	EZ1232008	削除ボタン非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.CardDeleteHiddenFlag 書式不正	
EZ1	EZ1233008	追加ボタン非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.CardAddHiddenFlag 書式不正	
EZ1	EZ1238008	セキュリティコード非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.SecCodeHiddenFlag 書式不正	
			dcc.SecCodeHiddenFlag 書式不正	
EZ1	EZ1238010	セキュリティコードが必須の場合、セキュリティコードを非表示に出来ません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.SecCodeRequiredFlag	
			credit.SecCodeHiddenFlag 不正	
			dcc.SecCodeRequiredFlag	
			dcc.SecCodeHiddenFlag 不正	
EZ1	EZ1244012	会社名が32桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispCompanyName桁数超過	
EZ1	EZ1244013	会社名の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			docomo.DispCompanyName書式不正	
EZ1	EZ1239008	口座名義任意名の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.AccountHolderOptionalName 書式不正	
EZ1	EZ1239005	口座名義任意名が20桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.AccountHolderOptionalName 桁数超過	
EZ1	EZ1243008	振込依頼人メールアドレスの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeClientMailaddress 書式不正	
EZ1	EZ1243005	振込依頼人メールアドレスが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeClientMailaddress 桁数超過	
EZ1	EZ1242013	振込依頼人氏名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeClientName 書式不正	
EZ1	EZ1242005	振込依頼人氏名が64桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeClientName 桁数超過	
EZ1	EZ1240011	取引有効日数が0～999の範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeDays 範囲不正	
EZ1	EZ1241013	取引事由に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeReason 書式不正	
EZ1	EZ1241005	取引事由が64桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			ganb.TradeReason 桁数超過	
EZ1	EZ1249001	SMS配信先携帯電話番号が指定されていません。	取引パラメータエラー	－
			geturlparam.SMSTelno 未指定	
EZ1	EZ1249006	SMS配信先携帯電話番号に数字以外の文字が含まれています。	取引パラメータエラー	－
			geturlparam.SMSTelno 書式不正	
EZ1	EZ1249012	SMS配信先携帯電話番号が15バイトを超えています。	取引パラメータエラー	－
			geturlparam.SMSTelno 桁数超過	
EZ1	EZ1250005	本人認証質問文言1が50桁を超えています。	取引パラメータエラー	－
			geturlparam.AuthenticationQuestion1 桁数超過	
EZ1	EZ1251005	本人認証答え1が50桁を超えています。	取引パラメータエラー	－
			geturlparam.AuthenticationAnswer1 桁数超過	
EZ1	EZ1252001	本人認証質問1の指定が正しくありません。本人認証質問文言1/本人認証答え1のいずれかの省略はできません。	取引パラメータエラー	－
			geturlparam.AuthenticationQuestion1	
			geturlparam.AuthenticationAnswer1	
			未指定	
EZ1	EZ1253005	本人認証質問文言2が50桁を超えています。	取引パラメータエラー	－
			geturlparam.AuthenticationQuestion2 桁数超過	
EZ1	EZ1254005	本人認証答え2が50桁を超えています。	取引パラメータエラー	－
			geturlparam.AuthenticationAnswer2 桁数超過	
EZ1	EZ1255001	本人認証質問2の指定が正しくありません。本人認証質問文言2/本人認証答え2のいずれかの省略はできません。	取引パラメータエラー	－
			geturlparam.AuthenticationQuestion2	
			geturlparam.AuthenticationAnswer2	
			未指定	
EZ1	EZ1256005	本人認証リトライ最大回数が2桁を超えています。	取引パラメータエラー	－
			geturlparam.AuthenticationRetryMax 桁数超過	
EZ1	EZ1256006	本人認証リトライ最大回数に数字以外の文字が含まれています。	取引パラメータエラー	－
			geturlparam.AuthenticationRetryMax 書式不正	
EZ1	EZ1256009	本人認証に失敗しました。	本人認証リトライ最大回数超過エラー	本人認証に失敗しました。
EZ1	EZ1257008	決済後カード登録時会員IDの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.RegistMemberID 書式不正	
			dcc.RegistMemberID 書式不正	
EZ1	EZ1258008	会員ID非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.MemberIDHiddenFlag 書式不正	
EZ1	EZ1259008	会員名非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			member.MemberNameHiddenFlag 書式不正	
EZ1	EZ1260008	取引詳細初期表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.TranDetailShowFlag 書式不正	
EZ1	EZ1261008	URL案内SMS送信フラグの書式が正しくありません。	取引パラメータエラー	－
			geturlparam.GuideSmsSendFlag 書式不正	
EZ1	EZ1262008	カード番号入力欄非表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.CardInputHiddenFlag 書式不正	
			dcc.CardInputHiddenFlag 書式不正	
EZ1	EZ1263011	最大カード登録枚数の範囲が1～5の範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.CardMaxCnt 書式不正	
			dcc.CardMaxCnt 書式不正	
			member.CardMaxCnt 書式不正	
EZ1	EZ1263017	登録済みのカードが最大カード登録枚数を超えています。	最大カード登録枚数超過エラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ1	EZ1264008	支払方法（複数指定）の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Methods 書式不正	
EZ1	EZ1264010	支払方法（複数指定）が一致しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Methods 不正	
EZ1	EZ1266005	商品名が255桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			unionpay.CommodityName 桁数超過	
EZ1	EZ1266013	商品名に利用できない文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			unionpay.CommodityName 書式不正	
EZ1	EZ1267008	確認画面スキップフラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.ConfirmSkipFlag 書式不正	
			member.ConfirmSkipFlag 書式不正	
EZ1	EZ1268005	完了時戻り先URLが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.CompleteUrl 桁数超過	
			member.CompleteUrl 桁数超過	
EZ1	EZ1268008	完了時戻り先URLの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.CompleteUrl 書式不正	
			member.CompleteUrl 書式不正	
EZ1	EZ1269005	キャンセル時戻り先URLが256桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.CancelUrl 桁数超過	
			member.CancelUrl 桁数超過	
EZ1	EZ1269008	キャンセル時戻り先URLの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.CancelUrl 書式不正	
			member.CancelUrl 書式不正	
EZ1	EZ1270009	ショップドメインが5件を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain 件数超過	
EZ1	EZ1271005	ショップドメイン1が253桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[0] 桁数超過	
EZ1	EZ1271008	ショップドメイン1の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[0] 書式不正	
EZ1	EZ1272005	ショップドメイン2が253桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[1] 桁数超過	
EZ1	EZ1272008	ショップドメイン2の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[1] 書式不正	
EZ1	EZ1273005	ショップドメイン3が253桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[2] 桁数超過	
EZ1	EZ1273008	ショップドメイン3の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[2] 書式不正	
EZ1	EZ1274005	ショップドメイン4が253桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[3] 桁数超過	
EZ1	EZ1274008	ショップドメイン4の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[3] 書式不正	
EZ1	EZ1275005	ショップドメイン5が253桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[4] 桁数超過	
EZ1	EZ1275008	ショップドメイン5の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.ShopDomain[4] 書式不正	
EZ1	EZ1278006	支払期限日数に数字以外の文字が含まれています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.PaymentTermDay 書式不正	
EZ1	EZ1278011	支払期限日数が有効な範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.PaymentTermDay 書式不正	
EZ1	EZ1265011	支払期限が有効な範囲ではありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.PaymentExpiryDateTime 書式不正	
EZ1	EZ1279008	結果通知先メールアドレス必須フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			cvs.MailAddressRequiredFlag 書式不正	
			payeasy.MailAddressRequiredFlag 書式不正	
EZ1	EZ1019002	指定したオリジナルデザインテンプレートのデータが存在しません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.TemplateID 値不正	
EZ1	EZ1019010	指定したオリジナルデザインテンプレートに公開データが登録されていません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.TemplateID 値不正	
EZ1	EZ1280008	3Dセキュア画面新規タブフラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			displaysetting.TdNewTabFlag 書式不正	
EZ1	EZ1281008	入金手続き完了通知メール送信無しフラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			transaction.NoCompletionEmailFlag 書式不正	
EZ1	EZ1282008	3Dセキュア認証用入力欄表示フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.Tds2InputShowFlag 書式不正	
			dcc.Tds2InputShowFlag 書式不正	
EZ1	EZ1301005	企業リンクURLが300桁を超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			mypayment.LinkUrl 桁数超過	
EZ1	EZ1301008	企業リンクURLの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			mypayment.LinkUrl 書式不正	
EZ1	EZ1302001	請求内容が指定されていません	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			mypayment.TransactionDetail 未指定	
EZ1	EZ1302008	請求内容の書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			mypayment.TransactionDetail 書式不正	
EZ1	EZ1302012	請求内容が30バイトを超えています。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			mypayment.TransactionDetail 桁数超過	
EZ1	EZ1303008	決済後強制カード登録フラグの書式が正しくありません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			credit.RegistMemberForceFlag 書式不正	
			dcc.RegistMemberForceFlag 書式不正	
EZ2系エラーコード：論理エラー、システムエラー				
　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　 　　　　				
コード	詳細コード	エラーメッセージ	エラー原因	ユーザへ表示するメッセージ例
EZ2	EZ2001002	取引情報を確認できません。詳細はショップにご確認ください。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL 不正	
EZ2	EZ2001010	不正な操作が行われました。このURLはご利用いただけません。	取引パラメータエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			リンクタイプ Plus決済URL 不正	
EZ2	EZ2001011	すでにお支払い手続きが完了しています。	完了取引再実行エラー	すでにお支払い手続きが完了しています。
EZ2	EZ2001012	お支払い手続きを実行できません。	無効取引実行エラー	お支払い手続きを実行できません。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2001013	お支払い期限日を過ぎています。	有効期限切れ取引実行エラー	お支払い期限日を過ぎています。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2001014	すでに決済を開始しており、このURLはご利用いただけません。	無効取引実行エラー	決済事業者での手続きが完了していません。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2002002	クレジットカード決済取引情報が取得できません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2002010	クレジットカード決済取引情報が一致しません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2002014	すでにクレジットカード決済が進行しているため、本画面ではクレジットカード決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2003010	すでにコンビニ決済が進行しているため、本画面ではコンビニ決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2004002	カード登録情報を確認できません。詳細はショップにご確認ください。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2004010	不正な操作が行われました。このURLはご利用いただけません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2004011	すでにカード編集手続きが完了しています。	完了取引再実行エラー	すでにカード編集手続きが完了しています。
EZ2	EZ2004012	カード編集手続きを実行できません。	無効取引実行エラー	カード編集手続きを実行できません。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2004013	カード編集期限日を過ぎています。	有効期限切れ取引実行エラー	カード編集期限日を過ぎています。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2005010	多通貨クレジットカード決済（DCC）取引情報が一致しません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2005014	すでに多通貨クレジットカード決済（DCC）が進行しているため、本画面では多通貨クレジットカード決済（DCC）を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2006010	すでにエポスかんたん決済が進行しているため、本画面ではエポスかんたん決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2007017	ショップ別レート照会に失敗しました。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2008010	すでにソフトバンクまとめて支払い決済が進行しているため、本画面ではソフトバンクまとめて支払い決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2009010	すでにauかんたん決済が進行しているため、本画面ではauかんたん決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2010010	すでにd払い決済が進行しているため、本画面ではd払い決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2011010	多通貨クレジットカード決済（MCP）取引情報が一致しません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2012010	すでにPay-easy決済が進行しているため、本画面ではPay-easy決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2013010	すでにLINE Pay決済が進行しているため、本画面ではLINE Pay決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2014010	すでにFamiPay決済が進行しているため、本画面ではFamiPay決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2015010	すでにメルペイ決済が進行しているため、本画面ではメルペイ決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2016010	すでに楽天ペイ決済が進行しているため、本画面では楽天ペイ決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2017010	すでにPayPay決済が進行しているため、本画面ではPayPay決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2018002	決済URL案内メールテンプレートが取得できません。	リクエストパラメータエラー	－
EZ2	EZ2019002	カード編集URL案内メールテンプレートが取得できません。	geturlparam.TemplateNo に指定したテンプレートが存在しません。管理画面からアップロード状況を確認してください。	－
EZ2	EZ2020002	購入ありがとうメールテンプレートが取得できません。		－
EZ2	EZ2021002	登録完了メールテンプレートが取得できません。		－
EZ2	EZ2022010	すでに銀行振込（バーチャル口座）決済が進行しているため、本画面では銀行振込（バーチャル口座）決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2024010	ページが二重に表示された可能性があります。再表示するか、既に表示済みのページから操作を行ってください。	二重送信エラー	ページが二重に表示された可能性があります。再表示するか、既に表示済みのページから操作を行ってください。
EZ2	EZ2025010	すでに楽天ペイ決済が進行しているため、本画面では楽天ペイ決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2069010	戻る・更新等の誤ったブラウザ操作を検知しました。初めからやり直すか、ほかのブラウザをご利用ください。	システム上許可していないエンドユーザー側の操作	戻る・更新等の誤ったブラウザ操作を検知しました。初めからやり直すか、ほかのブラウザをご利用ください。
EZ2	EZ2228010	SMS配信が可能な設定ではありません。	リンクタイプPlusSMS配信設定エラー	－
			SMS配信の設定が正しくありません。お問い合わせにて設定状況を確認してください。	
EZ2	EZ2229010	SMS配信が可能な設定ではありません。	リンクタイプPlusSMS配信契約エラー	－
			現在の契約ではSMS配信はご利用になれません。お問い合わせにて設定状況を確認してください。	
EZ2	EZ2230002	決済URL案内SMSテンプレートが取得できません。	リクエストパラメータエラー	－
EZ2	EZ2231002	会員編集URL案内SMSテンプレートが取得できません。	geturlparam.TemplateNo に指定したテンプレートが存在しません。管理画面からアップロード状況を確認してください。	－
EZ2	EZ2232001	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232002	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232003	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。現在の時間はSMSの配信ができません。
				SMS配信の可能な時間帯についてはお問い合わせください。
EZ2	EZ2232004	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232005	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232006	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232007	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。配信先電話番号の書式が正しくありません。
EZ2	EZ2232008	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232009	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232010	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232011	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。SMS配信の本文がUnicodeで660文字を超えています。
				テンプレートを修正してください。
EZ2	EZ2232012	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232013	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232014	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232015	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232016	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232017	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。指定されたSMS配信先携帯電話番号はSMS配信可能な電話番号帯に含まれておりません。
EZ2	EZ2232018	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。同一電話番号へのSMS送信制限を超過しました。
EZ2	EZ2232019	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。短時間に大量のリクエストを受信した為、受付が制限されました。
				申し訳ございませんが、しばらくした後にもう一度やり直してください。
EZ2	EZ2232020	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。現在、SMS配信が一時的にご利用頂けない状態です。
EZ2	EZ2232021	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2232022	SMS配信に失敗しました。	SMS配信エラー	SMS配信に失敗しました。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2233016	利用可能な編集操作が存在しません。	編集操作設定エラー	登録済みカード情報が存在しないため、カード情報の編集、または削除ができません。
EZ2	EZ2233017	登録上限数を超えるカード情報の追加はできません。	カード情報登録上限エラー	カード情報の登録上限に達しているため、新たにカードを追加できません。
EZ2	EZ2263017	最大カード登録枚数を超えるカード情報の追加はできません。	最大カード登録枚数登録上限エラー	最大カード登録枚数の上限に達しているため、新たにカードを追加できません。
EZ2	EZ2023010	すでにau PAY（ネット支払い）決済が進行しているため、本画面ではau PAY（ネット支払い）決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2264010	すでにネット銀聯決済が進行しているため、本画面ではネット銀聯決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2265010	マイペイメント取引情報が一致しません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2278002	取引情報を確認できません。	存在チェックエラー	－
			ショップID・オーダーIDに紐づく取引情報が存在しません。入力パラメータを確認してください。	
EZ2	EZ2278010	決済手続きを中止できない取引状態です。	取引状態不正エラー	決済手続きを中止出来ない取引状態です。取引状態を確認してください。
EZ2	EZ2279002	カード登録情報を確認できません。	存在チェックエラー	－
			ショップID・会員ID・カード編集番号に紐づくカード登録情報が存在しません。入力パラメータを確認してください。	
EZ2	EZ2279010	カード編集手続きを中止できない取引状態です。	取引状態不正エラー	カード編集手続きを中止出来ない取引状態です。取引状態を確認してください。
EZ2	EZ2026010	すでに銀行振込（バーチャル口座 あおぞら）決済が進行しているため、本画面では銀行振込（バーチャル口座 あおぞら）決済を行えません。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ2	EZ2400001	メンテナンス中のためコンビニ決済（ファミリーマート）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。	メンテナンスエラー	メンテナンス中のためコンビニ決済（ファミリーマート）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。
EZ2	EZ2400002	メンテナンス中のためコンビニ決済（セブン-イレブン）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。	メンテナンスエラー	メンテナンス中のためコンビニ決済（セブン-イレブン）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。
EZ2	EZ2400003	メンテナンス中のためコンビニ決済は一時的に利用できません。しばらくお待ちのうえ再度お試しください。	メンテナンスエラー	メンテナンス中のためコンビニ決済は一時的に利用できません。しばらくお待ちのうえ再度お試しください。
EZ2	EZ2400004	メンテナンス中のためコンビニ決済は一時的に利用できません。しばらくお待ちのうえ再度お試しください。	メンテナンスエラー	メンテナンス中のためコンビニ決済は一時的に利用できません。しばらくお待ちのうえ再度お試しください。
EZ2	EZ2400005	メンテナンス中のためPay-easy（ペイジー）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。	メンテナンスエラー	メンテナンス中のためPay-easy（ペイジー）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。
EZ2	EZ2400009	メンテナンス中のため銀行振込（バーチャル口座 あおぞら）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。	メンテナンスエラー	メンテナンス中のため銀行振込（バーチャル口座 あおぞら）は一時的に利用できません。しばらくお待ちのうえ再度お試しください。
EZ3系エラーコード：キャンセルエラー				
コード	詳細コード	エラーメッセージ	エラー原因	ユーザへ表示するメッセージ例
EZ3	EZ3013001	LINE Pay決済がキャンセルされました。	決済未完了エラー	お客様により、LINE Pay決済がキャンセルされました。再度決済を行う場合、お問い合わせください。
			お客様によるキャンセル	
EZ3	EZ3014001	FamiPay決済がキャンセルされました。	決済未完了エラー	お客様により、FamiPay決済がキャンセルされました。再度決済を行う場合、お問い合わせください。
			お客様によるキャンセル	
EZ3	EZ3001001	お取引がキャンセルされました。	決済未完了エラー	お客様により、決済がキャンセルされました。再度決済を行う場合、お問い合わせください。
			お客様によるキャンセル	
EZ4系ワーニングコード				
コード	詳細コード	ワーニング内容		
EZ4	EZ4135014	既に決済URL取得済みのオーダーIDに対して、決済URL取得APIを実行した。		
EZ4	EZ4136014	既にカード編集URL取得済みの会員ID、カード編集番号に対して、カード編集URL取得APIを実行した。		
EZ4	EZ4137014	メール送信に失敗した。		
		例：不正なメールアドレス、メールテンプレートが存在しない		
EZ9系エラーコード：システムエラー				
コード	詳細コード	エラーメッセージ	エラー原因	ユーザへ表示するメッセージ例
EZ9	EZ9001999	通信エラーが発生致しました。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
EZ9	EZ9099999	予期せぬエラーが発生しました。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			URLの不正改変、不正な画面遷移	
M系エラーコード				
コード	詳細コード	エラーメッセージ		
M01	M01004014	指定された取引は既に決済を依頼しています。		
M01	M01131010	入力されたカード番号は多通貨決済に対応していません。		
M01	M01311007	支払期限を過ぎています。詳細はショップにて問い合わせください。		
M01	M01558010	指定された商品カテゴリIDは定義されていません。詳細はショップにお問い合わせください。		
M01	M01010013	氏名に利用できない漢字・文字が含まれています。ひらがな、カナ、常用漢字、半角文字をご入力ください。		
M	上記以外	決済失敗しました。		
E系エラーコード				
コード	詳細コード	エラーメッセージ		
E01	E01250010	カードパスワードが違います。		
E01	E01260010	指定されたカード番号または支払方法が正しくありません。		
E11	E11010100	利用できないカードが指定されました。		
E21	E21010001	3Dセキュア認証に失敗しました。もう一度やり直してください。		
E21	E21010007	3Dセキュア認証に失敗しました。		
E21	E21010202	3Dセキュア認証に失敗しました。3Dセキュア認証パスワード登録後にもう一度やり直してください。		
E21	E21020001	3Dセキュア認証に失敗しました。もう一度やり直してください。		
E21	E21020002	3Dセキュア認証がキャンセルされました。もう一度やり直してください。		
E21	E21020999	3Dセキュア認証に失敗しました。		
E21	E21010999	3Dセキュア認証に失敗しました。もう一度やり直してください。		
E21	E21020007	3Dセキュア認証に失敗しました。もう一度やり直してください。		
E21	E21030001	3Dセキュア認証に失敗しました。もう一度やり直してください。		
E21	E21030007	3Dセキュア認証されませんでした。時間を空けてもう一度やり直してください。時間をあけても解消しない場合、ご利用のカード会社へお問い合わせください。		
E21	E21030201	このカードでは取引をする事ができません。3Dセキュア認証に対応したカードをお使いください。		
E21	E21030202	このカードでは取引をする事ができません。3Dセキュア認証に対応したカードをお使いください。		
E21	E21040001	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。		
E21	E21040002	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。		
E21	E21010201	このカードでは取引をする事ができません。3Dセキュア認証に対応したカードをお使いください。		
E41	E41170099	カード番号に誤りがあります。再度確認して入力してください。		
E61	E61010001	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
E61	E61010002	カード登録処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
E61	E61010003	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
E90	E90010001	現在処理を行っているため、もうしばらくお待ちください。		
E91	E91019999	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
E91	E91029999	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
E91	E91060001	システムエラーが発生しました。発生時刻や呼び出しパラメータをご確認のうえ、お問い合わせください。		
E91	E91099999	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
E	上記以外	システムエラーが発生しました。		
C系エラーコード				
コード	詳細コード	エラーメッセージ		
C01	42C010000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C03	42C030000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C12	42C120000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C13	42C130000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C14	42C140000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C15	42C150000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C50	42C500000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C51	42C510000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C53	42C530000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C54	42C540000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C55	42C550000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C56	42C560000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C57	42C570000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C58	42C580000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C60	42C600000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C70	42C700000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C71	42C710000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C72	42C720000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C73	42C730000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C74	42C740000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C75	42C750000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C76	42C760000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C77	42C770000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C78	42C780000	決済処理に失敗しました。申し訳ございませんが、しばらくした後にもう一度やり直してください。		
C	上記以外	カード会社との間で通信エラーが発生しました。		
G系エラーコード				
コード	詳細コード	エラーメッセージ		
G02	42G020000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G03	42G030000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G04	42G040000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G05	42G050000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G06	42G060000	残高が不足しています。		
G07	42G070000	カード会社とのエラーが発生しました。		
G12	42G120000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G22	42G220000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G30	42G300000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G42	42G420000	カード情報に誤りがあります。カード情報をもう一度ご確認ください。		
G44	42G440000	カード情報に誤りがあります。カード情報をもう一度ご確認ください		
G45	42G450000	カード会社とのエラーが発生しました。		
G54	42G540000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G55	42G550000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G56	42G560000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G60	42G600000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G61	42G610000	このカードでは取引をすることが出来ません。発行元カード会社にご確認ください。		
G65	42G650000	カード番号もしくは有効期限に誤りがあります。カード情報をもう一度ご確認ください。		
G67	42G670000	商品コードに誤りがあるために、決済を完了できませんでした。		
G68	42G680000	金額に誤りがあるために、決済を完了できませんでした。		
G69	42G690000	税送料に誤りがあるために、決済を完了できませんでした。		
G70	42G700000	ボーナス回数に誤りがあるために、決済を完了できませんでした。		
G71	42G710000	ボーナス月に誤りがあるために、決済を完了できませんでした。		
G72	42G720000	ボーナス額に誤りがあるために、決済を完了できませんでした。		
G73	42G730000	支払開始月に誤りがあるために、決済を完了できませんでした。		
G74	42G740000	分割回数に誤りがあるために、決済を完了できませんでした。		
G75	42G750000	分割金額に誤りがあるために、決済を完了できませんでした。		
G76	42G760000	初回金額に誤りがあるために、決済を完了できませんでした。		
G77	42G770000	業務区分に誤りがあるために、決済を完了できませんでした。		
G78	42G780000	支払区分に誤りがあるために、決済を完了できませんでした。		
G79	42G790000	照会区分に誤りがあるために、決済を完了できませんでした。		
G80	42G800000	取消区分に誤りがあるために、決済を完了できませんでした。		
G81	42G810000	取消取扱区分に誤りがあるために、決済を完了できませんでした。		
G83	42G830000	カード番号もしくは有効期限に誤りがあります。カード情報をもう一度ご確認ください。		
G92	42G920000	カード会社とのエラーが発生しました。		
G95	42G950000	カード会社とのエラーが発生しました。		
G96	42G960000	このカードでは取引をする事が出来ません。		
G97	42G970000	このカードでは取引をする事が出来ません。		
G98	42G980000	このカードでは取引をする事が出来ません。		
G99	42G990000	このカードでは取引をする事が出来ません。		
G	上記以外	カード会社とのエラーが発生しました。		
W系エラーコード				
コード	詳細コード	エラーメッセージ		
W	全て	決済失敗しました。		
P系エラーコード				
コード	詳細コード	エラーメッセージ		
P	全て	決済失敗しました。		
DC1系エラーコード				
コード	詳細コード	エラーメッセージ		
DC1	全て	決済失敗しました。		
SB1系エラーコード				
コード	詳細コード	エラーメッセージ		
SB1	全て	決済失敗しました。		
FP1系エラーコード				
コード	詳細コード	エラーメッセージ		
FP1	全て	決済失敗しました。		
AU1系エラーコード				
コード	詳細コード	エラーメッセージ		
AU1	全て	決済失敗しました。		
AMP系エラーコード				
コード	詳細コード	エラーメッセージ		
AMP	全て	決済失敗しました。		
LP系エラーコード				
コード	詳細コード	エラーメッセージ		
LP1	LP1000001	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1000002	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1000003	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1001163	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1001177	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1001180	LINE Pay決済にて支払の有効期限が経過しました。		
LP1	LP1009001	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1009002	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP1	LP1009003	LINE Pay決済にてエラーが発生しました。詳細はショップにて問い合わせください。		
LP2	LP2009900	LINE Pay決済にてシステムエラーが発生しました。詳細はショップにて問い合わせください。		
LP2	LP2009999	LINE Pay決済にてシステムエラーが発生しました。詳細はショップにて問い合わせください。		
RP系エラーコード				
コード	詳細コード	エラーメッセージ		
RP1	RP1000001	楽天ペイでシステムエラーが発生しました。しばらくお待ちのうえ再度お試しください。		
RP1	RP1000002	楽天ペイでタイムアウトが発生しました。再度お試しください。		
RP1	RP1000003	楽天ペイで処理中です。しばらくお待ちのうえ再度お試しください。		
RP1	RP1000004	利用カードを変更して再度お試しください。		
RP1	RP1000005	楽天ポイントの残高を確認して再度お試しください。		
RP1	RP1000006	楽天ペイでシステムエラーが発生しました。詳細はショップに問い合わせください。		
RP1	RP1000007	楽天ペイでシステムエラーが発生しました。しばらくお待ちのうえ再度お試しください。		
RP1	RP1000008	楽天ペイがアクセス過多により繋がりにくくなっています。しばらくお待ちのうえ再度お試しください。		
RP1	RP1000009	楽天ポイントが一時的に利用できません。利用ポイントを変更して再度お試しください。		
RP1	RP1000010	利用カードを変更して再度お試しください。		
RP1	RP1000011	楽天ペイはメンテナンス中のため一時的にご利用できません。しばらくお待ちのうえ再度お試しください。		
RP1	RP1000012	楽天ペイはメンテナンス中のため、一時的にご利用できません。		
RP1	RP1000013	楽天ペイでシステムエラーが発生しました。詳細はショップに問い合わせください。		
RP1	RP1000999	楽天ペイでシステムエラーが発生しました。		
その他エラーコード				
コード	詳細コード	エラーメッセージ	エラー原因	ユーザへ表示するメッセージ例
その他	ERR_EXEC	決済処理中にエラーが発生しました。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			URLの不正改変	
			不正な画面遷移	
その他	ERR_UNEXPECTED	予期せぬエラーが発生しました。	システムエラー	システムの内部エラーです。発生時刻や取引内容をご確認のうえ、お問い合わせください。
			URLの不正改変	
			不正な画面遷移	
E00	E00000001	－	接続方式エラー	－
			HTTPステータスコード405相当のエラーです。	
			HTTPメソッドが正しくありません。	
E00	E00000002	－	接続方式エラー	－
			HTTPステータスコード406相当のエラーです。	
			HTTPリクエストヘッダのAccept関連項目が正しくありません。	
E00	E00000003	－	接続方式エラー	－
			HTTPステータスコード415相当のエラーです。	
			HTTPリクエストヘッダのContent-type項目が正しくありません。	
E00	E00000010	－	接続方式エラー	－

";

    static public function getErrorInfo($error_code) {
        $Errors = explode("\n", self::ERRORS);
        $InfoList = [];
        $pre_code = '';

        foreach ($Errors as $error) {
            $cols = explode("\t", $error);
            if (count($cols) < 2) continue;

            $code = empty($cols[1]) ? $pre_code : $cols[1];
            $caption = $cols[2] ?? '';
            $detail = $cols[3] ?? '';
            $message = $cols[4] ?? '';

            $data = isset($InfoList[$code]) ? $InfoList[$code] : [];
            $data['caption'] = ($data['caption'] ?? '') . ' ' . $caption;
            $data['detail'] = ($data['detail'] ?? '') . ' ' . $detail;
            $data['message'] = ($data['message'] ?? '') . ' ' . $message;

            $InfoList[$code] = $data;

            $pre_code = $code;
        }
        return isset($InfoList[$error_code]) ? $InfoList[$error_code] : ['caption' => '-', 'detail' => '-', 'message' => '-'];
    }

}