<?php

// -------------------------------------------------------------------------------
// オートローダ/config 初期化

require_once "code/init.php";

// -----------------------------------------------------------------------
// .env 読み込み

Dotenv\Dotenv::createImmutable(__DIR__)->load();

// -------------------------------------------------------------------------------
// 共通関数
require_once "code/code.php";

// デバッグコード追加
if ($_ENV['APP_DEBUG']) {
    require_once "code/debug.php";
    // opcache無効
    ini_set('opcache.enable', 0);
    ini_set('opcache.enable_cli', 0);
}

// -------------------------------------------------------------------------------
// 定数定義

require_once "code/define.php";


// -------------------------------------------------------------------------------
// エラーハンドリング

require_once "code/error.php";




